authors = [
    (1,'Иванов','Александр'),
    (2, 'Петров', 'Алексей'),
    (3, 'Петров', 'Александр'),
    (4, 'Гоголь', 'Николай'),
    (5, 'Гончаров', 'Иван'),
    (6, 'Тургенев', 'Иван'),
    (7, 'Толстой', 'Лев'),
    (8, 'Островская', 'Анна'),
    (9, 'Чернышевский', 'Николай'),
    (10, 'Ананасов', 'Федор')
]

books = [
    (1, 'Последний сон', 'Повесть', 'OReilly Media', '2022', 'Библиотека №1'),
    (2, 'Война миров', 'Фантастика', 'Азбука', '2013', 'Склад'),
    (3, 'Попутный ветер', 'Детектив', 'Союз писателей', '2001', 'Библиотека №2'),
    (4, 'Путь к звездам', 'Повесть', 'Время', '1989', 'Библиотека №2'),
    (5, 'Огни ночного города', 'Класика', 'Легион', '1986', 'Книжный шкаф 1'),
    (6, 'У нас проблемы', 'Повесть', 'Азбука', '1958', 'Склад'),
    (7, 'И снова темнота', 'Фантастика', 'Эксмо', '2020', 'Публичная библиотека'),
    (8, 'Биография неизвестного', 'Драма', 'Речь', '2015', 'Библиотека №1'),
    (9, 'Во мгле вечной ночи', 'Повесть', 'Союз писателей', '1996', 'Склад'),
    (10, 'Вернись ко мне', 'Драма', 'АСТ', '1989', 'Публичная библиотека')
]

sections = [
    ('1', 'Фантастика'),
    ('2', 'Детектив'),
    ('3', 'Класика'),
    ('4', 'Роман'),
    ('5', 'Драма'),
    ('6', 'Повесть')
]

publishers = [
    ('1','OReilly Media', 'Севастополь'),
    ('2','Азбука', 'Санкт-Петербург'),
    ('3','Союз писателей', 'Новокузнецк'),
    ('4','Эксмо', 'Москва'),
    ('5','АСТ', 'Москва'),
    ('6','Речь', 'Санкт-Петербург'),
    ('7','Легион', 'Ростов-На-Дону'),
    ('8','Время', 'Москва')
]

author_book = [
    (1, 1, 1),
    (2, 2, 2),
    (3, 3, 3),
    (4, 4, 4),
    (5, 5, 5),
    (6, 6, 6),
    (7, 7, 7),
    (8, 8, 8),
    (9, 9, 9),
    (10, 10, 10)
]